tannerln7/Esp32Speakers/.pio/libdeps/Left/SigmaDSP/examples/2_First_order_EQ/SigmaStudio_project/Export/1_first_order_EQ_IC_1_REG.h
/*
 * Created:        Tuesday, May 1, 2018 1:27:51 PM
 * Description:    1_first_order_EQ:IC 1 control register definitions.
 *
 * This software is distributed in the hope that it will be useful,
 * but is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
 * CONDITIONS OF ANY KIND, without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * This software may only be used to program products purchased from
 * Analog Devices for incorporation by you into audio products that
 * are intended for resale to audio product end users. This software
 * may not be distributed whole or in any part to third parties.
 *
 * Copyright ©2018 Analog Devices, Inc. All rights reserved.
 *
 *
 */
#ifndef __1_FIRST_ORDER_EQ_IC_1_REG_H__
#define __1_FIRST_ORDER_EQ_IC_1_REG_H__


/* InterfaceRegister0  - Registers (IC 1) */
#define REG_INTERFACEREGISTER0_IC_1_ADDR          0x800
#define REG_INTERFACEREGISTER0_IC_1_BYTE          4
#define REG_INTERFACEREGISTER0_IC_1_VALUE         0x0

/* InterfaceRegister1  - Registers (IC 1) */
#define REG_INTERFACEREGISTER1_IC_1_ADDR          0x801
#define REG_INTERFACEREGISTER1_IC_1_BYTE          4
#define REG_INTERFACEREGISTER1_IC_1_VALUE         0x0

/* InterfaceRegister2  - Registers (IC 1) */
#define REG_INTERFACEREGISTER2_IC_1_ADDR          0x802
#define REG_INTERFACEREGISTER2_IC_1_BYTE          4
#define REG_INTERFACEREGISTER2_IC_1_VALUE         0x0

/* InterfaceRegister3  - Registers (IC 1) */
#define REG_INTERFACEREGISTER3_IC_1_ADDR          0x803
#define REG_INTERFACEREGISTER3_IC_1_BYTE          4
#define REG_INTERFACEREGISTER3_IC_1_VALUE         0x0

/* InterfaceRegister4  - Registers (IC 1) */
#define REG_INTERFACEREGISTER4_IC_1_ADDR          0x804
#define REG_INTERFACEREGISTER4_IC_1_BYTE          4
#define REG_INTERFACEREGISTER4_IC_1_VALUE         0x0

/* InterfaceRegister5  - Registers (IC 1) */
#define REG_INTERFACEREGISTER5_IC_1_ADDR          0x805
#define REG_INTERFACEREGISTER5_IC_1_BYTE          4
#define REG_INTERFACEREGISTER5_IC_1_VALUE         0x0

/* InterfaceRegister6  - Registers (IC 1) */
#define REG_INTERFACEREGISTER6_IC_1_ADDR          0x806
#define REG_INTERFACEREGISTER6_IC_1_BYTE          4
#define REG_INTERFACEREGISTER6_IC_1_VALUE         0x0

/* InterfaceRegister7  - Registers (IC 1) */
#define REG_INTERFACEREGISTER7_IC_1_ADDR          0x807
#define REG_INTERFACEREGISTER7_IC_1_BYTE          4
#define REG_INTERFACEREGISTER7_IC_1_VALUE         0x0

/* GpioAllRegister  - Registers (IC 1) */
#define REG_GPIOALLREGISTER_IC_1_ADDR             0x808
#define REG_GPIOALLREGISTER_IC_1_BYTE             2
#define REG_GPIOALLREGISTER_IC_1_VALUE            0x0

/* Adc0  - Registers (IC 1) */
#define REG_ADC0_IC_1_ADDR                        0x809
#define REG_ADC0_IC_1_BYTE                        1
#define REG_ADC0_IC_1_VALUE                       0x0

/* Adc1  - Registers (IC 1) */
#define REG_ADC1_IC_1_ADDR                        0x80A
#define REG_ADC1_IC_1_BYTE                        1
#define REG_ADC1_IC_1_VALUE                       0x0

/* Adc2  - Registers (IC 1) */
#define REG_ADC2_IC_1_ADDR                        0x80B
#define REG_ADC2_IC_1_BYTE                        1
#define REG_ADC2_IC_1_VALUE                       0x0

/* Adc3  - Registers (IC 1) */
#define REG_ADC3_IC_1_ADDR                        0x80C
#define REG_ADC3_IC_1_BYTE                        1
#define REG_ADC3_IC_1_VALUE                       0x0

/* CoreRegister  - Registers (IC 1) */
#define REG_COREREGISTER_IC_1_ADDR                0x81C
#define REG_COREREGISTER_IC_1_BYTE                2
#define REG_COREREGISTER_IC_1_VALUE               0x1C

/* RAMRegister  - Registers (IC 1) */
#define REG_RAMREGISTER_IC_1_ADDR                 0x81D
#define REG_RAMREGISTER_IC_1_BYTE                 1
#define REG_RAMREGISTER_IC_1_VALUE                0x8

/* SerialOutRegister1  - Registers (IC 1) */
#define REG_SERIALOUTREGISTER1_IC_1_ADDR          0x81E
#define REG_SERIALOUTREGISTER1_IC_1_BYTE          2
#define REG_SERIALOUTREGISTER1_IC_1_VALUE         0x0

/* SerialInputRegister  - Registers (IC 1) */
#define REG_SERIALINPUTREGISTER_IC_1_ADDR         0x81F
#define REG_SERIALINPUTREGISTER_IC_1_BYTE         1
#define REG_SERIALINPUTREGISTER_IC_1_VALUE        0x6

/* MpCfg0  - Registers (IC 1) */
#define REG_MPCFG0_IC_1_ADDR                      0x820
#define REG_MPCFG0_IC_1_BYTE                      3
#define REG_MPCFG0_IC_1_VALUE                     0x0

/* MpCfg1  - Registers (IC 1) */
#define REG_MPCFG1_IC_1_ADDR                      0x821
#define REG_MPCFG1_IC_1_BYTE                      3
#define REG_MPCFG1_IC_1_VALUE                     0x0

/* AnalogPowerDownRegister  - Registers (IC 1) */
#define REG_ANALOGPOWERDOWNREGISTER_IC_1_ADDR     0x822
#define REG_ANALOGPOWERDOWNREGISTER_IC_1_BYTE     2
#define REG_ANALOGPOWERDOWNREGISTER_IC_1_VALUE    0x0

/* TestRegister  - Registers (IC 1) */
#define REG_TESTREGISTER_IC_1_ADDR                0x823
#define REG_TESTREGISTER_IC_1_BYTE                2
#define REG_TESTREGISTER_IC_1_VALUE               0x0

/* AnalogInterfaceRegister0  - Registers (IC 1) */
#define REG_ANALOGINTERFACEREGISTER0_IC_1_ADDR    0x824
#define REG_ANALOGINTERFACEREGISTER0_IC_1_BYTE    2
#define REG_ANALOGINTERFACEREGISTER0_IC_1_VALUE   0x8000

/* AnalogInterfaceRegister1  - Registers (IC 1) */
#define REG_ANALOGINTERFACEREGISTER1_IC_1_ADDR    0x825
#define REG_ANALOGINTERFACEREGISTER1_IC_1_BYTE    2
#define REG_ANALOGINTERFACEREGISTER1_IC_1_VALUE   0x0

/* AnalogInterfaceRegister2  - Registers (IC 1) */
#define REG_ANALOGINTERFACEREGISTER2_IC_1_ADDR    0x826
#define REG_ANALOGINTERFACEREGISTER2_IC_1_BYTE    2
#define REG_ANALOGINTERFACEREGISTER2_IC_1_VALUE   0x0

/* AnalogInterfaceRegister3  - Registers (IC 1) */
#define REG_ANALOGINTERFACEREGISTER3_IC_1_ADDR    0x827
#define REG_ANALOGINTERFACEREGISTER3_IC_1_BYTE    2
#define REG_ANALOGINTERFACEREGISTER3_IC_1_VALUE   0x1


/*
 *
 * Control register's field descriptions
 *
 */

/* InterfaceRegister0 (IC 1) */
#define R0_INTERFACEREGISTER0_IC_1                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R0_INTERFACEREGISTER0_IC_1_MASK           0xFFFFFFFF
#define R0_INTERFACEREGISTER0_IC_1_SHIFT          0

/* InterfaceRegister1 (IC 1) */
#define R1_INTERFACEREGISTER1_IC_1                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R1_INTERFACEREGISTER1_IC_1_MASK           0xFFFFFFFF
#define R1_INTERFACEREGISTER1_IC_1_SHIFT          0

